windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>https://gd32mcu.com/data/documents/pack/</url>
  <name>GD32F10x_DFP</name>
  <description>GigaDevice GD32F10x Series Device Support and Examples</description>
  <releases>
     <release version="2.0.3" date="2022-07-27">
      update url address.
    </release>
     <release version="2.0.2" date="2021-12-06">
      update firmware for GD32F10x, update svd file DMA1 base address.
    </release>
     <release version="2.0.1" date="2018-08-02">
      update firmware for GD32F10x.
    </release>
     <release version="2.0.0" date="2015-06-26">
      Added GD32F10x device support.
    </release>
    <release version="1.1.0" date="2015-04-27">
      Added GD32F10x device support.
    </release>
    <release version="1.0.1">
      Updated device support files.
      Added SVD file.
      Added datasheets, manual.
      Renamed device names.
    </release>
    <release version="1.0.0">
      First Release version of GD32F1 Device Family Pack.
    </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32F10x</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32F10x Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M3 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
       <feature type="XTAL"               n="4000000"  m="16000000"  name="Crystal Oscillator"/>
      <feature type="CoreOther"       n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"               n="12"                                       name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="8000000"                             name="Internal 8M RC oscillator"/>
      <feature type="IntRC"              n="40000"                                name="Internal 40K RC oscillator"/>      
      <feature type="RTC"                n="32768"                                 name="RTC with 32.768 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                 n="3"                                         name="Internal PLL"/>
      <feature type="PowerMode"    n="4"                                          name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"    n="4"                                          name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="20"                                        name="External interrupt"/>            
      <feature type="Temp"             n="-40"          m="85"                name="Extended Operating Temperature Range"/>
      <feature type="ADC"               n="3"              m="12"                name="High-Performance ADC"/>
      <feature type="TempSens"      n="1"                                          name="Temperature sensor"/>
      <feature type="DAC"               n="2"              m="12"                name="Digital-to-analog converter"/>
      <feature type="Timer"             n="10"            m="16"                name="16-bit General Purpose Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Advanced Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Basic Timer"/>
      <feature type="Timer"             n="1"              m="24"                name="SysTick Timer"/>
      <feature type="WDT"               n="2"                                          name="Watchdog timer"/>
      <feature type="MPSerial"         n="4"                                          name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/> 
      <feature type="USART"            n="3"              m="6750000"     name="High-Speed USART Interface"/>
      <feature type="UART"              n="2"              m="6750000"     name="High-Speed UART Interface"/>
      <feature type="CAN"               n="2"                                          name="CAN 2.0b Controller"/>
      <feature type="USBOTG"          n="2"                                          name="High-Speed/Full-Speed USB OTG with PHY"/>
      <feature type="SDIO"               n="1"              m="8"                  name="SDIO Interface"/>
      <feature type="IOs"                 n="112"                                       name="IO pins"/>
      <feature type="I2C"                 n="2"                                           name="Low-Power I2C"/>
      <feature type="SPI"                  n="3"                                          name="SPI Interface"/>
      <feature type="ETH"                n="1"               m="100000000"  name="Integrated Ethernet MAC with PHY"/>
      <feature type="I2S"                  n="2"                                          name="I2S Interface"  />
      <feature type="VCC"                n="2.6"                m="3.6"          name="Voltage"/>
      <feature type="NVIC"               n="68"                                        name="NVIC"/>
      <feature type="Other"              n="1"                                         name="My other Interface"/>

      <!-- ************************  Subfamily 'GD32F101'  **************************** -->
      <subFamily DsubFamily="GD32F101">
        <processor Dclock="56000000"/>
        <description>
GD32F101xx - ARM Cortex-M3 Core
  Frequency up to 56 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal and 43 external interrupts, each interrupt has 16 priority levels

Flash memory
  Flash up to 3072 KB
  SRAM up to 80 KB
  2KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F101T4'  ***************************** -->
        <device Dname="GD32F101T4">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD  USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

