windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F101T6'  ***************************** -->
        <device Dname="GD32F101T6">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101T8'  ***************************** -->
        <device Dname="GD32F101T8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101TB'  ***************************** -->
        <device Dname="GD32F101TB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101C4'  ***************************** -->
        <device Dname="GD32F101C4">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101C6'  ***************************** -->
        <device Dname="GD32F101C6">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101C8'  ***************************** -->
        <device Dname="GD32F101C8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101CB'  ***************************** -->
        <device Dname="GD32F101CB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101R4'  ***************************** -->
        <device Dname="GD32F101R4">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101R6'  ***************************** -->
        <device Dname="GD32F101R6">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101R8'  ***************************** -->
        <device Dname="GD32F101R8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RB'  ***************************** -->
        <device Dname="GD32F101RB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101V8'  ***************************** -->
        <device Dname="GD32F101V8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

