windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F101VB'  ***************************** -->
        <device Dname="GD32F101VB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RC'  ***************************** -->
        <device Dname="GD32F101RC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VC'  ***************************** -->
        <device Dname="GD32F101VC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101ZC'  ***************************** -->
        <device Dname="GD32F101ZC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RD'  ***************************** -->
        <device Dname="GD32F101RD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VD'  ***************************** -->
        <device Dname="GD32F101VD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101ZD'  ***************************** -->
        <device Dname="GD32F101ZD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RE'  ***************************** -->
        <device Dname="GD32F101RE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VE'  ***************************** -->
        <device Dname="GD32F101VE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101ZE'  ***************************** -->
        <device Dname="GD32F101ZE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

