windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F101RF'  ***************************** -->
        <device Dname="GD32F101RF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VF'  ***************************** -->
        <device Dname="GD32F101VF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101ZF'  ***************************** -->
        <device Dname="GD32F101ZF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RG'  ***************************** -->
        <device Dname="GD32F101RG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VG'  ***************************** -->
        <device Dname="GD32F101VG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101ZG'  ***************************** -->
        <device Dname="GD32F101ZG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RI'  ***************************** -->
        <device Dname="GD32F101RI">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00200000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00200000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VI'  ***************************** -->
        <device Dname="GD32F101VI">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00200000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00200000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101ZI'  ***************************** -->
        <device Dname="GD32F101ZI">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00200000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00200000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101RK'  ***************************** -->
        <device Dname="GD32F101RK">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00300000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F101VK'  ***************************** -->
        <device Dname="GD32F101VK">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00300000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00300000" default="1"/>
        </device>

