windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F101ZK'  ***************************** -->
        <device Dname="GD32F101ZK">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00014000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00300000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00300000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'GD32F103'  **************************** -->
      <subFamily DsubFamily="GD32F103">
        <processor Dclock="108000000"/>
        <description>
GD32F103 - ARM Cortex-M3 Core
  Frequency up to108 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 interrupts, each interrupt has 16 priority levels
  Flash memory

Flash up to 3072 KB
  SRAM up to 96 KB
  2KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F103T4'  ***************************** -->
        <device Dname="GD32F103T4">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103C4'  ***************************** -->
        <device Dname="GD32F103C4">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103R4'  ***************************** -->
        <device Dname="GD32F103R4">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103T6'  ***************************** -->
        <device Dname="GD32F103T6">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103C6'  ***************************** -->
        <device Dname="GD32F103C6">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103R6'  ***************************** -->
        <device Dname="GD32F103R6">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103T8'  ***************************** -->
        <device Dname="GD32F103T8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103C8'  ***************************** -->
        <device Dname="GD32F103C8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103R8'  ***************************** -->
        <device Dname="GD32F103R8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103TB'  ***************************** -->
        <device Dname="GD32F103TB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103CB'  ***************************** -->
        <device Dname="GD32F103CB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103V8'  ***************************** -->
        <device Dname="GD32F103V8">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103VB'  ***************************** -->
        <device Dname="GD32F103VB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RB'  ***************************** -->
        <device Dname="GD32F103RB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_MD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_MD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00005000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_MD.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RC'  ***************************** -->
        <device Dname="GD32F103RC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103VC'  ***************************** -->
        <device Dname="GD32F103VC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

