windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F103ZC'  ***************************** -->
        <device Dname="GD32F103ZC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RD'  ***************************** -->
        <device Dname="GD32F103RD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103VD'  ***************************** -->
        <device Dname="GD32F103VD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103ZD'  ***************************** -->
        <device Dname="GD32F103ZD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RE'  ***************************** -->
        <device Dname="GD32F103RE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103VE'  ***************************** -->
        <device Dname="GD32F103VE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103ZE'  ***************************** -->
        <device Dname="GD32F103ZE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_HD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_HD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_HD.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RF'  ***************************** -->
        <device Dname="GD32F103RF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103VF'  ***************************** -->
        <device Dname="GD32F103VF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103ZF'  ***************************** -->
        <device Dname="GD32F103ZF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RG'  ***************************** -->
        <device Dname="GD32F103RG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103VG'  ***************************** -->
        <device Dname="GD32F103VG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103ZG'  ***************************** -->
        <device Dname="GD32F103ZG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F103RI'  ***************************** -->
        <device Dname="GD32F103RI">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_XD USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_XD.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00200000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_XD.FLM" start="0x08000000" size="0x00200000" default="1"/>
        </device>

