windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F105ZD'  ***************************** -->
        <device Dname="GD32F105ZD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105RE'  ***************************** -->
        <device Dname="GD32F105RE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105VE'  ***************************** -->
        <device Dname="GD32F105VE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105ZE'  ***************************** -->
        <device Dname="GD32F105ZE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105RF'  ***************************** -->
        <device Dname="GD32F105RF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105VF'  ***************************** -->
        <device Dname="GD32F105VF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105ZF'  ***************************** -->
        <device Dname="GD32F105ZF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105RG'  ***************************** -->
        <device Dname="GD32F105RG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105VG'  ***************************** -->
        <device Dname="GD32F105VG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F105ZG'  ***************************** -->
        <device Dname="GD32F105ZG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>
      </subFamily>

