windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
      <!-- ************************  Subfamily 'GD32F107'  **************************** -->
      <subFamily DsubFamily="GD32F107">
        <processor Dclock="108000000"/>
        <description>
GD32F107 - ARM Cortex-M3 Core
  Frequency up to 108 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal and 43 external interrupts, each interrupt has 16 priority levels

Flash memory
  Flash up to 1024 KB
  SRAM up to 96 KB
  2KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F107RB'  ***************************** -->
        <device Dname="GD32F107RB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107VB'  ***************************** -->
        <device Dname="GD32F107VB">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107RC'  ***************************** -->
        <device Dname="GD32F107RC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107VC'  ***************************** -->
        <device Dname="GD32F107VC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107ZC'  ***************************** -->
        <device Dname="GD32F107ZC">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00040000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107RD'  ***************************** -->
        <device Dname="GD32F107RD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107VD'  ***************************** -->
        <device Dname="GD32F107VD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107ZD'  ***************************** -->
        <device Dname="GD32F107ZD">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00060000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00060000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107RE'  ***************************** -->
        <device Dname="GD32F107RE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

