windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
        <!-- *************************  Device 'GD32F107VE'  ***************************** -->
        <device Dname="GD32F107VE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107ZE'  ***************************** -->
        <device Dname="GD32F107ZE">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107RF'  ***************************** -->
        <device Dname="GD32F107RF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107VF'  ***************************** -->
        <device Dname="GD32F107VF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107ZF'  ***************************** -->
        <device Dname="GD32F107ZF">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x000C0000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x000C0000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107RG'  ***************************** -->
        <device Dname="GD32F107RG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107VG'  ***************************** -->
        <device Dname="GD32F107VG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F107ZG'  ***************************** -->
        <device Dname="GD32F107ZG">
          <compile header="Device\Include\gd32f10x.h" define="GD32F10X_CL USE_STDPERIPH_DRIVER"/>
          <debug svd="SVD\GD32F10x\GD32F10x_CL.svd"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00018000" default="1" init   ="0"/>
          <memory id="IROM1"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <algorithm name="Flash\GD32F10x_CL.FLM" start="0x08000000" size="0x00100000" default="1"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F10xMD">
      <description>GigaDevice GD32F10x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F10[13]*[468B]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device Conditions -->
    <condition id="GD32F10xHD">
      <description>GigaDevice GD32F10x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F10[13]*[CDE]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F10xXD">
      <description>GigaDevice GD32F10x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F10[13]*[FGIK]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F10xCL">
      <description>GigaDevice GD32F10x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F10[57]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32F10x CMSIS">
      <description>GigaDevice GD32F10x Devices and CMSIS-CORE</description>
      <accept condition="GD32F10xMD"/>
      <accept condition="GD32F10xHD"/>
      <accept condition="GD32F10xXD"/>
      <accept condition="GD32F10xCL"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32F10x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="PMU"/>    
    </condition>
    <!-- GD32F10x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F10x STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F10x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="RCU"/>
    </condition>

