windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
     <!-- GD32F10x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F10x STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F10x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F10x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F10x STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F10x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="USART"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32F10x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="ADC" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_adc.c" attr="config" version="2.0.2" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="BKP" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Backup register(BKP) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_bkp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_bkp.c" attr="config" version="2.0.2" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="CAN" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_can.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="CRC" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_crc.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="DAC" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_dac.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="DBG" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_dbg.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="DMA" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_dma.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="ENET" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Ethernet(ENET) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
        <files>
          <!-- ENET flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_enet.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_enet.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="EXMC" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_exmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_exmc.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="EXTI" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_exti.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="FMC" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_fmc.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="FWDGT" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_fwdgt.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="GPIO" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_gpio.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="I2C" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_i2c.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="MISC" Cversion="2.0.2"  condition="GD32F10x CMSIS">
      <description>MISC driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_misc.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="PMU" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_pmu.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="RCU" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_rcu.c" attr="config" version="2.0.2" />
        </files>
    </component>

