windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="RTC" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_rtc.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="SDIO" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Secure digital input/output interface(SDIO) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_sdio.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="SPI_I2S" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_spi.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="TIMER" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_timer.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="USART" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_usart.c" attr="config" version="2.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F10x_StdPeripherals" Csub="WWDGT" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f10x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f10x_wwdgt.c" attr="config" version="2.0.2" />
        </files>
    </component>

    <!-- Utilities GD32F103B -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F103B" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports for GD32F103B board</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f103b_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f103b_eval.c" attr="config" version="2.0.2"/>
      </files>
    </component>

    <!-- Utilities GD32F103C -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F103C" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports for GD32F103C board</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f103c_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f103c_eval.c" attr="config" version="2.0.2"/>
      </files>
    </component>

    <!-- Utilities GD32F103E -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F103E" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports for GD32F103E board</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f103e_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f103e_eval.c" attr="config" version="2.0.2"/>
      </files>
    </component>

    <!-- Utilities GD32F105C -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F105C" Cversion="2.0.2" condition="GD32F10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports for GD32F105C board</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f105c_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f105c_eval.c" attr="config" version="2.0.2"/>
      </files>
    </component>

    <!-- Utilities GD32F107C -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F107C" Cversion="2.0.2"  condition="GD32F10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports for GD32F107C board</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f107c_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f107c_eval.c" attr="config" version="2.0.2"/>
      </files>
    </component>

