windowsair/elaphure-dap.js/device/deviceList/GigaDevice/GD32F10x/GigaDevice.GD32F10x_DFP.pdsc
    <!-- Config GD32F10x -->
    <component Cclass="Device" Cgroup="GD32F10x_libopt" Cversion="2.0.2"  condition="GD32F10x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32f10x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32F10x MD -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="2.0.2" condition="GD32F10xMD">
      <description>System Startup for GigaDevice GD32F101 and GD32F103 Middle Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f10x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f10x_md.s" attr="config" version="2.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f10x.c"      attr="config" version="2.0.2"/>
      </files>
    </component>

   <!-- Startup GD32F10x HD -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="2.0.2" condition="GD32F10xHD">
      <description>System Startup for GigaDevice GD32F101 and GD32F103 High Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f10x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f10x_hd.s" attr="config" version="2.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f10x.c"      attr="config" version="2.0.2"/>
      </files>
    </component>

   <!-- Startup GD32F10x XD -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.0.2"  condition="GD32F10xXD">
      <description>System Startup for GigaDevice GD32F101 and GD32F103 Extra Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f10x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f10x_xd.s" attr="config" version="2.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f10x.c"      attr="config" version="2.0.2"/>

      </files>
    </component>

   <!-- Startup GD32F10x CL -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.0.2"  condition="GD32F10xCL">
      <description>System Startup for GigaDevice GD32F105 and GD32F107 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f10x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f10x_cl.s" attr="config" version="2.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f10x.c"      attr="config" version="2.0.2"/>
      </files>
    </component>
  </components>

</package>
